/* 배너 버튼 이벤트 */
function view1(opt) {
	if(opt) {
		whole2.style.display = "block";
	}
	else {
		whole2.style.display = "none";
	}
}

function view2(opt) {
	if(opt) {
		  previous2.style.display = "block";
	}
	else {
		  previous2.style.display = "none";
	}
}

function view3(opt) {
	if(opt) {
		  accumulate2.style.display = "block";
	}
	else {
		  accumulate2.style.display = "none";
	}
}

/*주소 select 시/군/도*/
$('document').ready(function() {
	var area0 = ["시/도 ","서울","부산","대구","인천","광주","대전","울산","경기","강원", "세종","충청남도","충청북도","전라남도","전라북도","경상남도","경상북도","제주도"];
	var area1 = ["시/군/구","강남구","강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구","용산구","은평구","종로구","중구","중랑구"]; /*서울*/
	var area2 = ["시/군/구","강서구","금정구","기장군","남구","동구","동래구","부산진구","북구","사상구","사하구","서구","수영구","연제구","영도구","중구","해운대구"]; /*부산*/
	var area3 = ["시/군/구","남구","달서구","달성군","동구","북구","서구","수성구","중구"]; /*대구*/
	var area4 = ["시/군/구","강화군","계양구","남구","남동구","동구","부평구","서구","연수구","옹진군","중구"]; /*인천*/
	var area5 = ["시/군/구","광산구","남구","동구","북구","서구"]; /*광주*/
	var area6 = ["시/군/구","대덕구","동구","서구","유성구","중구"]; /*대전*/
	var area7 = ["시/군/구","남구","동구","북구","중구","울주군"]; /*울산*/
	var area8 = ["시/군/구","가평군","고양시","과천시","광명시","광주시","구리시","군포시","김포시","남양주시","동두천시","부천시","성남시","수원시","시흥시","안산시","안성시","안양시","양주시","양평군","여주시","연천군","오산시","용인시","의왕시","의정부시","이천시","파주시","평택시","포천시","하남시","화성시"]; /*경기*/
	var area9 = ["시/군/구","강릉시","고성군","동해시","삼척시","속초시","양구군","양양군","영월군","원주시","인제군","정선군","철원군","춘천시","태백시","평창군","홍천군","화천군","횡성군"]; /*강원*/
	var area10 = ["시/군/구","가람동","고운동","금남면","나성동","다정동","대평동","도담동","반곡동","보람동", "소담동","소정명","아름동","어진동","연기면","연동면","연서면","장군면","전동면","전의면","조치원읍","종촌동","한솔동"]; /*세종*/
	var area11 = ["시/군/구","계룡시","공주시","금산군","논산시","당진시","보령시","부여군","서산시","서천군","아산시","예산군","천안시","청양군","태안군","홍성군"]; /*충청남도*/
	var area12 = ["시/군/구","괴산군","단양군","보은군","영동군","옥천군","음성군","제천시","증평군","진천군","청원군","청주시","충주시"]; /*충청북도*/
	var area13 = ["시/군/구","강진군","고흥군","곡성군","광양시","구례군","나주시","담양군","목포시","무안군","보성군","순천시","신안군","여수시","영광군","영암군","완도군","장성군","장흥군","진도군","함평군","해남군","화순군"]; /*전라남도*/
	var area14 = ["시/군/구","고창군","군산시","김제시","남원시","무주군","부안군","순창군","완주군","익산시","임실군","장수군","전주시","정읍시","진안군"]; /*전라북도*/
	var area15 = ["시/군/구","거제시","거창군","고성군","김해시","남해군","밀양시","사천시","산청군","양산시","의령군","진주시","창녕군","창원시","통영시",,"하동군","함안군","함양군","합천군"]; /*경상남도*/
	var area16 = ["시/군/구","경산시","경주시","고령군","구미시","군위군","김천시","문경시","봉화군","성주군","상주시","안동시","영덕군","영양군","영주시","영천시","예천군","울릉군","울진군","의성군","청도군","청송군","칠곡군","포항시"]; /*경상북도*/
	var area17 = ["시/군/구","서귀포시","제주시"]; /*제주도*/

// 시/도 선택 박스 초기화

	$("select[name^=sido]").each(function() {
		$selsido = $(this);
		$.each(eval(area0), function() {
			$selsido.append("<option value='"+this+"'>"+this+"</option>");
		});
		$selsido.next().append("<option value=''>구/군 선택</option>");
	});

	 
// 시/도 선택시 구/군 설정
	$("select[name^=sido]").change(function() {
		var area = "area"+$("option",$(this)).index($("option:selected",$(this))); // 선택지역의 구군 Array
		var $gugun = $(this).next(); // 선택영역 군구 객체
		$("option",$gugun).remove(); // 구군 초기화

		if(area == "area0")
			$gugun.append("<option value=''>시/군/구</option>");
		else {
			$.each(eval(area), function() {
				$gugun.append("<option value='"+this+"'>"+this+"</option>");
			});
		}
	});
});

/* 찾기 버튼 이벤트 */
$(function() {
	$('.find').hide();
	
	$('.btn_find').click(function() {
		$('.find').show();
	});
});